Написать программу для расчёта энергии, требуемой для разгона покоящегося тела указанной массы до указанной скорости. Программа должна производить два расчёта: по Ньютону и по Эйнштейну, каждый расчёт должен производиться отдельной функцией: `calc_newton()` и `calc_einstein()`, соответственно. Данные функции должны:

  * быть совместимы по типам (возвращаемого значения и аргументов);

  * не выводить данные на экран;

  * в случае некорректных входных данных возвращать значение `nan()`.

Написать функцию `verify_calc()`, принимающую в качестве аргумента указатель на функцию (совместимую с указанными выше), исходные данные и ожидаемый результат. Внимание: проверка на то, что функция вернула not-a-number, должна производиться с помощью функции `isnan()`. Возвращаемым значением для `verify_calc()` должно быть 1 если полученный ответ сходится с ожидаемым, и 0, если нет. Также данная функция должна через указатель возвращать фактически полученное значение.

Функция `main()` должна вызывать `verify_calc()` для каждой функции `calc_*` на нескольких наборах данных и выводить на экран сообщения о проблемах, если и только если `verify_calc()` возвращает не нулевое значение. То есть, если программа отработала без сбоев, то на экран не должно быть выведено ничего. Сообщения должны выглядеть примерно следующим образом:

 calc\_newton failed for mass 123kg and speed 456m/s: expected ... but got ...

Для такого вывода вызов функции `printf()` будет выглядеть примерно так:

 printf("calc\_newton failed for mass %fkg and speed %fm/s: expected %f but got %f\n",
     mass, speed, expected, actual);

Для переменных, хранящих физические значения, следует использовать тип `double`. Функции `nan()` и `isnan()` определены в заголовочном файле `<float.h>`.

Набор тестовых значений оформить в виде массива структур. Каждая структура должна содержать, как минимум, поля для исходных значений и ожидаемого результата.

Пример в файле `selftest.c`.

После проведения самотестирования функция main(), если возникли ошибки, должна завершиться с кодом 2. Если ошибок не возникло, то программа должна запросить у пользователя данные, произвести вычисления и вывести результат на экран. Если в ходе вычислений возникнет ошибка, то main() должна выйти с кодом 1, при отсутствии проблем — с кодом 0.

Задание со звёздочкой: после самотестирования сначала проверить, были ли переданы `main()` аргументы (`argc > 1`). Если да, то использовать их в качестве исходных значений, а не запрашивать данные у пользователя. Для перевода строки в число с плавающей запятой используйте функцию `atof()` (`<string.h>`). Не забудьте проверить, что пользователь передал верное число аргументов, чтобы, например, не обратиться к `argv[2]` при `argc == 2`. Дополнительная информация: https://en.cppreference.com/w/c/string/byte

Задание с двумя звёздочками: заменить функцию `atof()` на `strtod()`.
