Написать программу для расчёта энергии, требуемой для разгона покоящегося тела указанной массы до указанной скорости. Программа должна производить два расчёта: по Ньютону и по Эйнштейну, каждый расчёт должен производиться отдельной функцией: `calc_newton()` и `calc_einstein()`, соответственно. Данные функции должны:

  * быть совместимы по типам (возвращаемого значения и аргументов);

  * не выводить данные на экран;

  * в случае некорректных входных данных возвращать значение `nan()`.

Написать функцию `verify_calc()`, принимающую в качестве аргумента указатель на функцию (совместимую с указанными выше), исходные данные и ожидаемый результат. Внимание: проверка на то, что функция вернула not-a-number, должна производиться с помощью функции `isnan()`. Возвращаемым значением для `verify_calc()` должно быть 1 если полученный ответ сходится с ожидаемым, и 0, если нет.

Функция `main()` должна вызывать `verify_calc()` для каждой функции `calc_*` на нескольких наборах данных и выводить на экран сообщения о проблемах, если и только если `verify_calc()` возвращает не нулевое значение. То есть, если программа отработала без сбоев, то на экран не должно быть выведено ничего. Сообщения должны выглядеть примерно следующим образом:

 calc\_newton failed for mass 123kg and speed 456m/s

Для такого вывода вызов функции `printf()` будет выглядеть примерно так:

 printf("calc\_newton failed for mass %fkg and speed %fm/s\n", mass, speed);

Для переменных, хранящих физические значения, следует использовать тип `double`. Функции `nan()` и `isnan()` определены в заголовочном файле `<float.h>`.
